/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   executer.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: miyazawa.kai.0823 <miyazawa.kai.0823@st    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/10/18 17:22:15 by miyazawa.ka       #+#    #+#             */
/*   Updated: 2023/11/07 11:49:59 by miyazawa.ka      ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include"../include/minishell.h"

//今後どんな構造になるかわからないですが、ざっくりの見通しのために、構文木化済みのものを実行する関数を枠だけ置いておきました。
void	executor(t_data *data)
{
	if (data)
		;
}
