/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   lexer.c                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: miyazawa.kai.0823 <miyazawa.kai.0823@st    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/10/18 17:19:25 by miyazawa.ka       #+#    #+#             */
/*   Updated: 2023/10/18 17:21:56 by miyazawa.ka      ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include"../include/minishell.h"

//今後どんな構造になるかわからないですが、ざっくりの見通しのために、入力された文字列をトークンにする関数を枠だけ置いておきました。
void	lexer(char *line, t_data *data)
{
	if (data && line)
		;
}
