/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   perser.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: miyazawa.kai.0823 <miyazawa.kai.0823@st    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/10/18 17:22:39 by miyazawa.ka       #+#    #+#             */
/*   Updated: 2023/11/07 11:53:30 by miyazawa.ka      ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include"../include/minishell.h"

//今後どんな構造になるかわからないですが、ざっくりの見通しのために、トークンを構文木にする関数を枠だけ置いておきました。
void	perser(t_data *data)
{
	if (data)
		;
}
